УТ.УчетЗадач/src/Catalogs/cbr_Цвета/cbr_Цвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_Цвета</name>
  <attributes>
    <name>ЦветHEX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветRGB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекстаRGB</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ.УчетЗадач/src/Catalogs/cbr_Цвета/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьЦвет(Команда)
	ОткрытьФормуВыбораЦвета("ЦветHEX", "ЦветRGB", "ЦветТекстаRGB");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормыВыбораЦветаКалендарь(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Или Не ЗначениеЗаполнено(ВыбранноеЗначение) Или ВыбранноеЗначение
		= КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли; 	
	
	// Цвет фона/текста в HEX	
	ИмяРеквизитаЦветаНЕХ 			= ДополнительныеПараметры.ИмяРеквизитаЦветаHEX;
	Объект[ИмяРеквизитаЦветаНЕХ] 	= ВыбранноеЗначение.ЦветHEX;         
	
	// Цвет фона/текста в RGB (для фона элемента формы)

	ЦветФона = Новый Цвет(ВыбранноеЗначение.ЦветRGB.R, ВыбранноеЗначение.ЦветRGB.G, ВыбранноеЗначение.ЦветRGB.B);

	Элементы.ФормаВыбратьЦвет.ЦветФона = ЦветФона;

	МассивЧастейЦвета = Новый Массив;
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.R);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.G);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветRGB.B);

	Объект[ДополнительныеПараметры.ИмяРеквизитаЦветаRGB] = СтрСоединить(МассивЧастейЦвета, ",");

	МассивЧастейЦвета = Новый Массив;
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.R);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.G);
	МассивЧастейЦвета.Добавить(ВыбранноеЗначение.ЦветТекстаRGB.B);

	Объект[ДополнительныеПараметры.ИмяРеквизитаЦветаТекстаRGB] = СтрСоединить(МассивЧастейЦвета, ",");

	ЦветТекста = Новый Цвет(ВыбранноеЗначение.ЦветТекстаRGB.R, ВыбранноеЗначение.ЦветТекстаRGB.G,
		ВыбранноеЗначение.ЦветТекстаRGB.B);

	Элементы.ФормаВыбратьЦвет.ЦветТекста = ЦветТекста;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЦвета(ИмяРеквизитаЦветаНЕХ, ИмяРеквизитаЦветаРГБ = "", ИмяРеквизитаЦветаТекстаРГБ = "")
	ДополнительныеПараметры = Новый Структура("ИмяРеквизитаЦветаHEX, ИмяРеквизитаЦветаRGB, ИмяРеквизитаЦветаТекстаRGB",
		ИмяРеквизитаЦветаНЕХ, ИмяРеквизитаЦветаРГБ, ИмяРеквизитаЦветаТекстаРГБ);
	ПослеЗакрытияФормыВыбораЦвета = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВыбораЦветаКалендарь",
		ЭтотОбъект, ДополнительныеПараметры);
	ПараметрФормы = Новый Структура("Цвет", Объект[ИмяРеквизитаЦветаНЕХ]);
	ОткрытьФорму("ОбщаяФорма.cbr_ФормаВыбораЦвета", ПараметрФормы, ЭтотОбъект, , , , ПослеЗакрытияФормыВыбораЦвета);
КонецПроцедуры
#КонецОбласти
